---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures
source: html/b48f211b-4082-e5e2-25d6-f5468b93c81b.htm
---
# BuiltInFailures.WallJoinFailures Properties

Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.